import allure
import pytest

queries_negative = [
    '##монитор$',
    '/* монитор */',
    ' ~~монитор',
    '~монитор /',
    '/* монитор */',
    '((монитор))',
    'ktrnhjcxtnxbr',
    'монта зиркало',
    'eckeub',
    'мониотр',
    '\\ cnjks',
    '!@#$%^&***()}{[]\/*//*',
    "монолит плюс",
    "монолит",
    "плюс",
    "эльдорадо",
    "dns-shop",
    "городская поликлиника 22",
    "гбуз нсо городская клиническая поликлиника  22",
    "ИНВИТРО-Сибирь",
    "жэу ремстрой ооо",
    "RBT",
    'анализ',
    'кирпич',
    'монитор',
    'мир',
    'смартфоны',
    'узи почек',
    "анализ мочи",
    "вет клиника Арника",
    "мед осмотр на водительские права",
    "курсы обучения иностранных языков",
    "курсы вождения"
]

@pytest.mark.parametrize('words', queries_negative)
@allure.title('Поиск товаров/услуг для заполнения кэша на сервере http://demo2.bis077.local')
def test_search_click_to_button(demo2, words):
    '''
        Для обкатки на локальном сервере demo2
    :param demo2:
    :param words:
    :return:
    '''
    demo2.search_goods.search_goods_click_to_button(words)
